[Strings]
;=====================================================================================================================
;								GESTIONE REPORTS 
;=====================================================================================================================

; ------------------------------------------------------------------- 
; Pagina RecorderShowReports.aspx
; ------------------------------------------------------------------- 
RecorderShowReport_msg_ReportNotSpecified =Report not specified
RecorderShowReport_msg_NoRecordsFound =No records found
RecorderShowReport_msg_InvalidStartDate=*Date inputs must be compiled
RecorderShowReport_btn_RunReport =Run report
RecorderShowReport_btn_Schedule	=Schedule
ReportFilterPane_schedule_dialog_title	=Schedule

; ------------------------------------------------------------------- 
; Control ReportFilterPane
; ------------------------------------------------------------------- 
ReportFilterPane_Title			=Report options
ReportFilterPane_label_data		=Per recordings with date:
ReportFilterPane_label_fromdate =From: 
ReportFilterPane_label_specificdate =Date:
ReportFilterPane_label_todate   =To:
ReportFilterPane_label_direction =Per direction:
ReportFilterPane_label_duration =With duration:
ReportFilterPane_label_users	=Users:
ReportFilterPane_label_nodes	=Server nodes:
ReportFilterPane_label_size	=With size:
ReportFilterPane_label_groups	=Recording groups:
ReportFilterPane_label_notes =Notes:
ReportFilterPane_DurationDescription =Between $MIN$ and $MAX$
ReportFilterPane_SizeDescription =Between $MIN$ MB and $MAX$ MB
ReportFilterPane_label_button_ok	=OK
ReportFilterPane_label_button_cancel	=Cancel
ReportFilterPane_label_button_deselect_all	=Unselect all
ReportFilterPane_label_button_search	=Search
ReportFilterPane_select_users_dialog_title	=Select users
ReportFilterPane_select_users_dialog_table_username	=username
ReportFilterPane_select_users_dialog_table_name	=name
ReportFilterPane_select_users_dialog_table_surname	=surname
ReportFilterPane_select_groups_dialog_title	=Select recording groups
ReportFilterPane_select_groups_dialog_table_name	=name
ReportFilterPane_select_nodes_dialog_title	=Select server node
ReportFilterPane_select_nodes_dialog_table_name	=server
ReportFilterPane_label_selected	=selected
ReportFilterPane_selection_dialog_norecords	=No records found
ReportFilterPane_label_nodesFilterUnavailable =Server filter is disabled because Replication Service is not reachable now.
ReportFilterPane_label_preservation =Marked to be preserved:

; ------------------------------------------------------------------- 
; Enum DateTimePeriods
; ------------------------------------------------------------------- 
DateTimePeriods_label_Today			=Today
DateTimePeriods_label_Yesterday		=Yesterday
DateTimePeriods_label_ThisWeek		=This Week
DateTimePeriods_label_LastWeek		=Last Week
DateTimePeriods_label_ThisMonth		=This Month
DateTimePeriods_label_LastMonth		=Last Month
DateTimePeriods_label_LastTwoMonth	=Last Two Month
DateTimePeriods_label_ThisYear		=This Year
DateTimePeriods_label_LastYear		=Last Year
DateTimePeriods_label_SpecificDay	=Specific Day
DateTimePeriods_label_DateInterval	=Date Interval

; ------------------------------------------------------------------- 
; Enum NodesFilterType
; ------------------------------------------------------------------- 
NodesFilterType_label_All	=All
NodesFilterType_label_Selection		=Specific server

; ------------------------------------------------------------------- 
; Enum UsersFilterType
; ------------------------------------------------------------------- 
UsersFilterType_label_All	=All
UsersFilterType_label_Selection		=Specific users

; ------------------------------------------------------------------- 
; Enum GroupsFilterType
; ------------------------------------------------------------------- 
GroupsFilterType_label_All	=All
GroupsFilterType_label_Selection		=Specific groups

; ------------------------------------------------------------------- 
; Enum Direction
; ------------------------------------------------------------------- 
Directions_label_All	=All
Directions_label_In		=Incoming
Directions_label_Out	=Outgoing

; ------------------------------------------------------------------- 
; Enum Preservation
; ------------------------------------------------------------------- 
Preservation_label_All			=All
Preservation_label_Preserved		=Yes
Preservation_label_Unpreserved	=No

; ------------------------------------------------------------------- 
; Reports
; ------------------------------------------------------------------- 
RecorderReport_Title_RecordingList	=Recording list
RecorderReport_Title_VolumeByUser =Recording Volume by User
RecorderReport_Title_VolumeByGroup =Recording Volume by Group
RecorderReport_Title_VolumeByServerNode =Recording Volume by Server Node
RecorderReport_Title_VolumeByTenant =Recording Volume by Tenant
RecorderReport_Title_BusyChannels =Recording Busy Channels

RecorderReport_CaptionLabel =* The symbol '>' indicates that the real value is greater than the one displayed. This real value cannot be calculated due to the absence of previous data.
RecorderReport_AvailableLicenses_CaptionLabel =If there are no calls in a certain time quantum, the relative value of available recording licenses is represented by a forecasted value and not by the real value.
RecorderReport_TimeZone_CaptionLabel =Important! Filters and data shown in the graph use the Server time zone:
RecorderReport_DataShown_CaptionLabel =The data shown are not a representation of a historical data but represent the current status of the recordings saved and available in the system.

Report_FilterTemplate_DateRange	=#FIELD_NAME# between #FROM# and #TO#
Report_FilterTemplate_DateRangeFromOnly	=#FIELD_NAME# after or equal to #FROM#
Report_FilterTemplate_DateRangeToOnly	=#FIELD_NAME# before or equal to #TO#
Report_FilterTemplate_DateRangeSpecificDay	=#FIELD_NAME# is #DAY#
Report_FilterTemplate_DecimalRangeSpecificValue	=#FIELD_NAME# is equal to #VALUE#
Report_FilterTemplate_DecimalRangeToOnly	=#FIELD_NAME# is lower than #TO#
Report_FilterTemplate_DecimalRangeFromOnly	=#FIELD_NAME# is greater than #FROM#
Report_FilterTemplate_DecimalRange	=#FIELD_NAME# between #FROM# and #TO#
Report_FilterTemplate_DecimalSingleSpecificValue =#FIELD_NAME# is equal to #VALUE#
Report_FilterTemplate_DurationInterval	=#FIELD_NAME# between #FROM# and #TO#
Report_FilterTemplate_DurationIntervalFromOnly	=#FIELD_NAME# is greater than #FROM#
Report_FilterTemplate_DurationIntervalToOnly	=#FIELD_NAME# is lower than #TO#
Report_FilterTemplate_SingleValue	=#FIELD_NAME# is #VALUE#
Report_FilterTemplate_SingleValuePart	=#FIELD_NAME# contain #VALUE#
Report_FilterTemplate_ListValues	=#FIELD_NAME# in [#VALUES#]
Report_FilterTemplate_OrValues	=any of: [#VALUES#]

Report_DisplayValue_Preservation_marked= marked as preserved
Report_DisplayValue_Preservation_notMarked= not marked as preserved

RecorderReport_FilterDisplayName_Size 		=Size (MB)
RecorderReport_FilterDisplayName_Nodes 		=Server Node
RecorderReport_FilterDisplayName_Notes 		=Notes
RecorderReport_FilterDisplayName_StartDate	=Date
RecorderReport_FilterDisplayName_Direction	=Direction
RecorderReport_FilterDisplayName_Duration	=Duration
RecorderReport_FilterDisplayName_Users	=User
RecorderReport_FilterDisplayName_Groups	=Recording group
RecorderReport_FilterDisplayName_Preservation	=Recording

; ------------------------------------------------------------------- 
; Rdlc Reports
; ------------------------------------------------------------------- 

RecorderReport_Tenant =Tenant
RecorderReport_Size =Size (MB)
RecorderReport_Node =Server
RecorderReport_Direction =Dir
RecorderReport_Date =Date
RecorderReport_Duration =Duration
RecorderReport_Group =Group
RecorderReport_User =User
RecorderReport_User_Phone_Number =Phone N°
RecorderReport_Remote_Party =Remote Party
RecorderReport_Record_Id =Rec Id
RecorderReport_Pbx_Call_Id =PBX Call Id
RecorderReport_Note =Note
RecorderReport_Outgoing =Out
RecorderReport_Incoming =In
RecorderReport_Preserved =Yes
RecorderReport_NotPreserved =No
RecorderReport_FooterDateUpdatedTo =Data updated to
RecorderReport_Preservation =Pin
RecorderReport_TotalCalls =Tot. Recordings
RecorderReport_TotalDuration =Tot. Duration
RecorderReport_TotalSize =Tot. Size (MB)
RecorderReport_TotalIncomingCalls =Incoming
RecorderReport_TotalOutgoingCalls =Outgoing
RecorderReport_TotalUnknownCalls =Unknown Dir
RecorderReport_MaxDuration =Max Duration
RecorderReport_AvgDuration =Mean Duration
RecorderReport_MaxSize =Max Size (MB)
RecorderReport_AvgSize =Mean Size (MB)
RecorderReport_From =Start interval
RecorderReport_To =End interval
RecorderReport_MaxBusyChannels =Busy channels
RecorderReport_MaxLicensedChannels = Available channels
RecorderReport_MissedCalls =Rejected Calls

RecorderReport_ChannelsUseStatus =Channels Use Status
RecorderReport_TableLabel_MaxBusyChannels =Max Channels Used
RecorderReport_TableLabel_MissedCalls =No. of Rejected Calls

RecorderReport_ChartCallsTitle_ByUser =TOT. RECORDINGS (TOP 10 USERS)
RecorderReport_ChartDurationTitle_ByUser =TOT. DURATION (TOP 10 USERS)
RecorderReport_ChartCallsTitle_ByGroup=TOT. RECORDINGS (TOP 10 GROUPS)
RecorderReport_ChartDurationTitle_ByGroup=TOT. DURATION (TOP 10 GROUPS)
RecorderReport_ChartCallsTitle_ByNode=TOT. RECORDINGS
RecorderReport_ChartDurationTitle_ByNode=TOT. DURATION
RecorderReport_ChartCallsTitle_ByTenant=TOT. RECORDINGS (TOP 10 TENANT)
RecorderReport_ChartSizeTitle_ByTenant=TOT. SIZE (TOP 10 TENANT)
RecorderReport_ChartCallsByDirectionTitle_ByUser =DIRECTIONS OF RECORDED CALLS (TOP 10 USERS)
RecorderReport_ChartCallsByDirectionTitle_ByGroup =DIRECTIONS OF RECORDED CALLS (TOP 10 GROUPS)
RecorderReport_ChartCallsByDirectionTitle_ByNode =DIRECTIONS OF RECORDED CALLS
RecorderReport_ChartCallsByDirectionTitle_ByTenant =DIRECTIONS OF RECORDED CALLS (TOP 10 TENANT)

RecorderReport_ChartLegendLabelOutgoing =Outgoing
RecorderReport_ChartLegendLabelUnknown =Unknown
RecorderReport_ChartLegendLabelIncoming =Incoming
RecorderReport_ChartUnitOfMeasure=MB
RecorderReport_ChartUnknownGroup =
RecorderReport_ChartUnknownTenant =
RecorderReport_ChartUnknownNode =
RecorderReport_TooltipPreservationMarked=Recording marked as preserved

RecorderReport_Total =Totals